# Use the latest versions instead of the built in versions
brew "git"
brew "vim"

# Upgrade terminal experience
brew "starship" # fancy prompt
brew "git-delta" # Prettier Git diffs
brew "antigen" # zsh plugin manager

# Because setting up and managing node versions is a pain
brew "volta" # Better nvm

brew "go"

# Replace some tools with rust versions
brew "ripgrep" # Better grep
brew "fd" # Better find
brew "bat" # Better cat
brew "eza" # Better ls
brew "zoxide" # Better cd
brew "fzf" # Fuzzy finder
brew "tealdeer" # Faster but simpler man pages

# GPG tooling
brew "gpg"
brew "pinentry-mac"

## Casks

# Productivity
brew "alfred"
brew "visual-studio-code"
brew "alacritty"
# brew "hammerspoon"
brew "maccy"
brew "dropbox"
brew "todoist"
brew "google-chrome"
brew "chrysalis"
brew "iina"

# Messaging
brew "slack"
brew "discord"

